backend/controllers/SiteController.php

SELECT * FROM `category` ORDER BY `Date` DESC
INSERT INTO `category` (`Name`, `Price`, `Description`) VALUES ('Vàng 980', 5200000, 'Vàng nữ trang, trang sức 24k')
---
    public function actionCreate_category() //Tạo loại vàng
    {
        $model = new Category(); //Model này được tạo ra bằng gii
        $request = Yii::$app->request;
        $categoryData = new Category();
        if($model->load(Yii::$app->request->post()) && $model->validate())
        {
            $record = new Category;
            $record->Name = $request->post('Category')['Name'];
            $record->Price = $request->post('Category')['Price'];
            $record->Description = $request->post('Category')['Description'];
            $record->save();
            $categoryData = Category::find()->orderBy(['Date'=>SORT_DESC])->all();

SELECT * FROM `user` ORDER BY `Date` DESC
---
    public function actionCreate_user() //Tạo người sử dụng
    {
        $model = new User(); //Model này được tạo ra bằng gii
        $request = Yii::$app->request;
        $userData = new User();
        if($model->load(Yii::$app->request->post()) && $model->validate())
        {
            $record = new User;
            $record->AuthId = $request->post('User')['AuthId']; //Thiết lập mẫu mỗi khi tạo user đều là Admin
            $record->UserName = $request->post('User')['UserName'];
            $record->Password = $request->post('User')['Password'];
            $record->FullName = $request->post('User')['FullName'];
            $record->Address = $request->post('User')['Address'];
            $record->CitizenId = $request->post('User')['CitizenId'];
            $record->Email = $request->post('User')['Email'];
            $record->Phone = $request->post('User')['Phone'];
            $record->Notes = $request->post('User')['Notes'];
            $record->save();

            $userData = User::find()->orderBy(['Date'=>SORT_DESC])->all();