backend/controllers/SiteController.php

SELECT * FROM `authority`
INSERT INTO `authority` (`Name`, `Description`, `Rank`) VALUES ('Administrator', 'Người tổng quản trị ', 1)
---
    public function actionCreate_authority()
    {
        $model = New Authority();
        $request = Yii::$app->request;
        $list_rank = ['1'=>'Admin', '2'=>'Manager', '3'=>'User', '4'=>'VIP'];
        if($model->load(Yii::$app->request->post()) && $model->validate())
        {
            $record = new Authority();
            $record->Name = $request->post('Authority')['Name'];
            $record->Description = $request->post('Authority')['Description'];
            $record->Rank = $request->post('selector');
            $record->save();