backend/controllers/SiteController.php

    public function actionProduct_group()
    {
        $model = new ProductGroup();
        $request = Yii::$app->request;
        if($model->load(Yii::$app->request->post()) && $model->validate())
        {
            $record = new ProductGroup();
            $record->Name = $request->post('ProductGroup')['Name'];
            $record->Note = $request->post('ProductGroup')['Note'];
            $record->Rank = $request->post('ProductGroup')['Rank'];
            $record->save();
            $PG_data = ProductGroup::find()->all();
            return $this->render('createProductGroup',['model'=>$model,'PG_data'=>$PG_data,'message'=>'Tạo dữ liệu mới thành công']);
        }
        $PG_data = ProductGroup::find()->all();
---
SELECT * FROM `product_group`
INSERT INTO `product_group` (`Name`, `Note`, `Rank`) VALUES ('Nhẫn cặp', 'Nhẫn căp tình yêu', 1)

    public function actionCreate_product()
    {
        $model = new Product();
        $pics = new Picture();
        $request = Yii::$app->request;
        $category_opt = [];
        $categoryId = [];
        $groupId = [];
        $group_opt = [];
        $pics_opt = [];
        $picsId = [];
        $i = 0;
        $pics = Picture::find()->where(['ProductId'=>0])->all();
        $category = Category::find()->all();
        $productGroup = ProductGroup::find()->all();
---
SELECT * FROM `pictures` WHERE `ProductId`=0
SELECT * FROM `category`
SELECT * FROM `product_group`

            $record->CategoryId = $categoryId[(int)$request->post('categoryOpt')];
            $record->GroupId = $groupId[(int)$request->post('productGroupOpt')];
            $record->UserId = 1;
            $record->save();
---
INSERT INTO `product` (`Name`, `Description`, `Price`, `Discount`, `CategoryId`, `GroupId`, `UserId`) VALUES ('Nhẫn cặp 04', 'Nhẫn cặp tình yêu', 1000, 0, 1, 1, 1)

    public function actionProduct_edit()
    {
        $data = Yii::$app->request->get('data');
        $product = Product::findOne($data);
---
SELECT * FROM `product` WHERE `Id`='1'

        $itemsPerPage = 10;

        // Tạo đối tượng Pagination dùng để phân trang có hỗ trợ bởi Yii 2.0
        $pagination = new Pagination([
            'defaultPageSize' => 10, // Số lượng mục trên mỗi trang
            'totalCount' => Product::find()->where(['Status' => 1])->count(), // Tổng số mục
        ]);

        $TopRankViewProds = Product::find()
            ->where(['Rank' => 2])
            ->all();
        $product = Product::find()
            ->where(['Status' => 1])
            ->orderBy(['GroupId' => SORT_ASC])
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `product` WHERE `Status`=1
SELECT * FROM `product` WHERE `Rank`=2
SELECT * FROM `product` WHERE `Status`=1 ORDER BY `GroupId` LIMIT 10

    public function actionCreate_category() //Tạo loại vàng
    {
        $model = new Category(); //Model này được tạo ra bằng gii
        $request = Yii::$app->request;
        $categoryData = new Category();
        if($model->load(Yii::$app->request->post()) && $model->validate())
        {
            $record = new Category;
            $record->Name = $request->post('Category')['Name'];
            $record->Price = $request->post('Category')['Price'];
            $record->Description = $request->post('Category')['Description'];
            $record->save();
            $categoryData = Category::find()->orderBy(['Date'=>SORT_DESC])->all();
---
INSERT INTO `category` (`Name`, `Price`, `Description`) VALUES ('Bạc', 90000, 'Bạc cao cấp')
SELECT * FROM `category` ORDER BY `Date` DESC