frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $product = Product::find()->all();
        $group = ProductGroup::find()->all();
        $groupId = array_map(function($data) {
            return $data['Id'];
        }, $group);
        $tab = ['one','two','three'];
        $tab_one = $tab_true = $tab_three = null ;
        $productFilter = ['one','two'];

        $tab_one = Product::find()
                ->where(['GroupId'=>$groupId[0]])
                ->all();

        $tab_two = Product::find()
                ->where(['GroupId'=>$groupId[1]])
                ->all();

        $tab_three = Product::find()
                ->where(['GroupId'=>$groupId[2]])
                ->all();

        $product_new = Product::find()
                ->where(['Rank'=>2])     //Rank = 2 là sản phẩm mới
                ->all();

        $product_special = Product::find()
                ->where(['Rank'=>1])    //Rank = 1 là sản phẩm đặc biệt
                ->all();
---
SELECT * FROM `product`
SELECT * FROM `product_group`
SELECT * FROM `product` WHERE `GroupId`=1
SELECT * FROM `product` WHERE `GroupId`=2
SELECT * FROM `product` WHERE `GroupId`=3
SELECT * FROM `product` WHERE `Rank`=2
SELECT * FROM `product` WHERE `Rank`=1