backend/models/Pictures.php

INSERT INTO `pictures` (`ProductId`, `Image`) VALUES (3, 'ID3_1.png')
SELECT * FROM `product` WHERE `Id`=3
UPDATE `product` SET `Images`='ID3_1.png;ID3_2.png;' WHERE `Id`=3
---
    public function upload()
    {
        $i = 1;
        $path = dirname(__FILE__) . '/../../frontend/web/imgs/shop/';
        if ($this->Image && $this->validate()) {
            foreach ($this->Image as $file) {
                //$name = 'ID' . Yii::$app->cache->get('productId') . '_' . $file->baseName . rand(1, 99) . '_' . $names[$i] . '.' . $file->extension;
                $name = 'ID' . Yii::$app->cache->get('productId') . '_' . $i++ . '.' . $file->extension;
                $imageName = $name . ';';
                $Sql_name = Yii::$app->cache->get('ImageNames');
                $Sql_name .= $imageName;
                Yii::$app->cache->set('ImageNames',$Sql_name);
                $smodel = new Picture();
                $smodel->ProductId = Yii::$app->cache->get('productId');
                $smodel->Image = $name;
                if ($smodel->save()) {
                    $file->saveAs($path . $name);
                }
            }

            $updateImage = Product::findOne(Yii::$app->cache->get('productId'));
            $updateImage->Images = Yii::$app->cache->get('ImageNames');
            $updateImage->save();